---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyleOverrideOptions.SetAllOverrides(System.Boolean)
source: html/133e108d-b0c9-1de0-98ea-b78b65633603.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.SetAllOverrides Method

Sets all overrides to a specific value.

## Syntax (C#)
```csharp
public void SetAllOverrides(
	bool bOverride
)
```

## Parameters
- **bOverride** (`System.Boolean`) - The value that will be assigned to all the overrides.